TramaEngineering/S32K344-CANHUB_Demo/src/main.c
/*
 *   (c) Copyright 2022 NXP
 *
 *   NXP Confidential. This software is owned or controlled by NXP and may only be used strictly
 *   in accordance with the applicable license terms.  By expressly accepting
 *   such terms or by downloading, installing, activating and/or otherwise using
 *   the software, you are agreeing that you have read, and that you agree to
 *   comply with and are bound by, such license terms.  If you do not agree to
 *   be bound by the applicable license terms, then you may not retain,
 *   install, activate or otherwise use the software.
 *
 *   This file contains sample code only. It is not part of the production code deliverables.
 *
 *   FreeRTOS IEEE1772 ACF-CAN application for MR-CANHUBK3
 */

/* Including necessary configuration files. */
#include "Clock_Ip.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "Siul2_Port_Ip.h"
#include "Siul2_Dio_Ip.h"
#include "Siul2_Icu_Ip.h"
#include "Siul2_Icu_Ip_Irq.h"
#include "IntCtrl_Ip.h"
#include "Gmac_Ip.h"
#include "FlexCAN_Ip.h"
#include "Lpspi_Ip.h"
#include <stdio.h>
#include <string.h>
//#include "avtp_defs.h"
#include "ethernet_type.h"

#include "can.h"
#include "enet.h"
#include "fs26.h"
#include "uart.h"
#include "./uart_print/retarget.h"
#include "Pit_Ip.h"
#include "IntCtrl_Ip.h"
#include "bsp.h"

/*gptp libraries*/
#include "Devassert.h"
#include "gptp.h"
#include "gptp_port_platform.h"
#include "s32k344_gptp_config.h"
#include "Clock_Ip.h"

#include "EthTrcv.h"
#include "EthIf_Cbk.h"
#include "gptp_cbk.h"

//define a vector of can queues (RTOS)
#define CAN_COUNT 6
#define MILLISECOND_IN_NS               (1000000U)
#define GMAC_MAX_CTRLIDX_SUPPORTED 		1U
// NO_FRRERTOS defined in bsp.h

QueueHandle_t eth_can_queues[CAN_COUNT];
/*message queue to be filled with the message to be sent when button is pressed*/
QueueHandle_t tx_queue_send;
Gmac_Ip_TimestampType timestamp;
Gmac_Ip_TimestampType old_timestamp;
uint8 polling;
uint16 send_dummy = 0;
uint16 send_fr = 1;
Gmac_Ip_BufferType * customMessage_UDP;
uint8_t * udpFrame;

const char* buttonMsg = "CANHUBK3";

const Flexcan_Ip_MsgBuffType buttonCanFrame = {
		.cs = 0x0,
		.msgId = 0x12,
		.data = "CANHUBK3",
		.dataLen = 8,
		.id_hit = 0,
		.time_stamp = 0
};


Gmac_Ip_BufferType buttonEthFrame = { .Data = pDelayResp_frame, .Length=68};


void set_rgb_status(rgb_status status) {
	switch(status) {
		case INITIALIZE:
			Siul2_Dio_Ip_SetPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_ClearPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case ERROR:
			Siul2_Dio_Ip_ClearPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_SetPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case NOMINAL:
			Siul2_Dio_Ip_SetPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_ClearPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_SetPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case ETH_ACTIVITY:
			Siul2_Dio_Ip_ClearPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_ClearPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case RED:
			Siul2_Dio_Ip_ClearPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_SetPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case GREEN:
			Siul2_Dio_Ip_SetPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_ClearPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_SetPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case BLUE:
			Siul2_Dio_Ip_SetPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_ClearPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case CYAN:
			Siul2_Dio_Ip_SetPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_ClearPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_ClearPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case YELLOW:
			Siul2_Dio_Ip_ClearPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_ClearPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_SetPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case MAGENTA:
			Siul2_Dio_Ip_ClearPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_ClearPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;

		case WHITE:
			Siul2_Dio_Ip_SetPins(LED_RED_PORT, (1 << LED_RED_PIN));
			Siul2_Dio_Ip_SetPins(LED_GREEN_PORT, (1 << LED_GREEN_PIN));
			Siul2_Dio_Ip_SetPins(LED_BLUE_PORT, (1 << LED_BLUE_PIN));
			break;
	}
}

rgb_status error_st = RED;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

static void EEPROM_Init(void);
static void EEPROM_Enqueue_Write(const uint8_t cu8Port,
                                 const uint8_t cu8Offset,
                                 const uint32_t cu32Length,
                                 const uint8_t *cpu8Data);
static void EEPROM_Write_Poll(void);
static uint8_t EEPROM_Read(const uint8_t cu8Port,
                           const uint8_t cu8Offset,
                           const uint32_t cu32Length,
                           uint8_t *pu8Data);
static void EEPROM_Poll(void);
static void Eth_Poll(void);
static void Eth_PollLinkStatus(void);

void HardFault_Handler(void)
{
	/* Hard fault occured */
	set_rgb_status(error_st);
	while(TRUE){};
}

/*******************************************************************************
 * Local functions
 ******************************************************************************/

void button_sw1(void)
{
	/*if(send_dummy == 0){
		send_dummy = 512;
		customMessage_UDP = &customMessage_UDP_512;
		udpFrame = udpFrame512;
		printf("Send dummy 512 B\r\n!");
		send_fr = 50;
		printf("Send dummy 50 us B\r\n!");
	}
	else{
		send_dummy = 0;
		printf("Send dummy off!!\r\n!");
	}*/


	switch(send_dummy){
		case 0:
			send_dummy = 128;
			customMessage_UDP = &customMessage_UDP_128;
			udpFrame = udpFrame128;
			printf("Send dummy 128 B\r\n!");
		break;
		case 128:
			send_dummy = 512;
			customMessage_UDP = &customMessage_UDP_512;
			udpFrame = udpFrame512;
			printf("Send dummy 512 B\r\n!");
		break;
		case 512:
			send_dummy = 1400;
			customMessage_UDP = &customMessage_UDP_1400;
			udpFrame = udpFrame1400;
			printf("Send dummy 1400 B\r\n!");
		break;
		case 1400:
			send_dummy = 0;
			printf("Send dummy not active\r\n!");
			/*send_dummy = 128;
			printf("Send dummy 128 B\r\n!");*/
		break;
		default:
			send_dummy = 0;
			printf("Send dummy not active\r\n!");
		break;
	}
	if(send_dummy != 0){
		switch(send_fr){
				case 1:
					printf("Send dummy 1 ms\r\n!");
				break;
				case 200:
					printf("Send dummy 200 us\r\n!");
				break;
				case 100:
					printf("Send dummy 100 us B\r\n!");
				break;
				case 50:
					printf("Send dummy 50 us\r\n!");
				break;
				default:
					printf("Send dummy not active\r\n!");
				break;
			}
	}
}

