TramaEngineering/S32K344-CANHUB_Demo/src/main.c
void button_sw2_ethernet(void)
{
	if(send_dummy != 0){
		switch(send_dummy){
			case 0:
				printf("Send dummy not active\r\n!");
			break;
			case 128:
				printf("Send dummy 128 B\r\n!");
			break;
			case 512:
				printf("Send dummy 512 B\r\n!");
			break;
			case 1400:
				printf("Send dummy 1400 B\r\n!");
			break;
			default:
				printf("Send dummy not active\r\n!");
			break;
		}
		switch(send_fr){
			case 1:
				send_fr = 200;
				printf("Send dummy 200 ms\r\n!");
			break;
			case 200:
				send_fr = 100;
				printf("Send dummy 100 us\r\n!");
			break;
			case 100:
				send_fr = 50;
				printf("Send dummy 50 us B\r\n!");
			break;
			case 50:
				send_fr = 1;
				printf("Send dummy 1 ms\r\n!");
			break;
			default:
				send_fr = 1;
				printf("Send dummy 1 ms\r\n!");
			break;
		}
	}


}

//void button_sw2(void)
//{
//	/* Send CAN Frame to the CAN1 device */
//	if( xQueueSendFromISR( eth_can_queues[1],
//			( void * ) &buttonCanFrame,	NULL))
//	{
//		/* Failed queue CAN frame drop packet */
//	}
//}

/**
 * @brief            Function the fs26 source file will call to do SPI communication with the FS26.
 *
 * @param[in]        TxBuffer - pointer to transmit buffer.
 * @param[in-out]    RxBuffer - pointer to receive buffer.
 * @param[in]        Length - number of bytes to be sent.
 *
 * @return           0 = LPSPI_IP_STATUS_SUCCESS: Transmission command has been accepted.
 *                   1 = LPSPI_IP_FIFO_ERROR: Overflow or underflow error occurred.
 *                   2 = LPSPI_IP_STATUS_FAIL: Transmission command has not been accepted.
 *                   3 = LPSPI_IP_TIMEOUT: Timeout error occurred.
 */
int fs26SpiTransferFunction(uint8_t *TxBuffer, uint8_t *RxBuffer, uint16_t Length)
{
	Lpspi_Ip_StatusType spiStat;

	spiStat = Lpspi_Ip_SyncTransmit(&Lpspi_Ip_DeviceAttributes_SpiExternalDevice_3_Instance_3,
			TxBuffer, RxBuffer, Length, 1000);

	return (int)spiStat;
}
void link_check(uint8 channel){
	(void) channel;
	//Siul2_Dio_Ip_TogglePins(TP31_PORT, 1<<TP31_PIN);
	//old_timestamp = timestamp;
	//get_current_time(&timestamp);
	/* toggle LED1 */
	Task_Flag_Cnt++;

	//ENET_PPS_CLK_GEN(); /* to generate 500Hz clock output */
	static volatile uint64_t u64PitIsrCountMs = 0;

	/* Increment 1ms = 1000000 ns. */
	//GPTP_PORT_IncFreeRunningTimer(MILLISECOND_IN_NS);

	//	Task_Flag_1mS = 1;
	//	if((Task_Flag_Cnt % 10) == 0)
	//		Task_Flag_10mS = 1;
	//	if((Task_Flag_Cnt % 2) == 0)
	//			Task_Flag_2mS = 1;
	//	if((Task_Flag_Cnt % 100) == 0)
	//		Task_Flag_100mS = 1;
	//	if((Task_Flag_Cnt % 200) == 0)
	//			Task_Flag_200mS = 1;
	//	if((Task_Flag_Cnt % 1000) == 0){
	//		//Siul2_Dio_Ip_TogglePins(LED2_PORT, 1<<LED2_PIN);
	//		Task_Flag_1000mS = 1;
	//		Task_Flag_Cnt = 0;
	//	}
	//	u64PitIsrCountMs++;

		Task_Flag_50uS = 1;
		if((Task_Flag_Cnt % 2) == 0)
			Task_Flag_100uS = 1;
		if((Task_Flag_Cnt % 4) == 0)
				Task_Flag_200uS = 1;
		if((Task_Flag_Cnt % 20) == 0){
			Task_Flag_1mS = 1;
			u64PitIsrCountMs++;

			//ENET_PPS_CLK_GEN(); /* to generate 500Hz clock output */

			/* Increment 1ms = 1000000 ns. */
			GPTP_PORT_IncFreeRunningTimer(MILLISECOND_IN_NS);
		}
		if((Task_Flag_Cnt % 200) == 0)
			Task_Flag_10mS = 1;
		if((Task_Flag_Cnt % 40) == 0)
				Task_Flag_2mS = 1;
		if((Task_Flag_Cnt % 2000) == 0)
			Task_Flag_100mS = 1;
		if((Task_Flag_Cnt % 4000) == 0)
				Task_Flag_200mS = 1;
		if((Task_Flag_Cnt % 20000) == 0){
			//Siul2_Dio_Ip_TogglePins(LED2_PORT, 1<<LED2_PIN);
			Task_Flag_1000mS = 1;
			Task_Flag_Cnt = 0;
		}
		/*if((Task_Flag_Cnt % (5*2400000)) == 0){
				button_sw2_ethernet();
			Task_Flag_Cnt = 0;
		}
		if((Task_Flag_Cnt % (2400000)) == 0){
			if(((send_dummy==1400) && (send_fr == 100)) || ((send_dummy==1400) && (send_fr == 50)))
				Task_Flag_Cnt += 2400000-1;
			else
				button_sw1();
		}*/

	return;
}

///*******************************************************************************
// * EEPROM FUNCTIONS
// ******************************************************************************/
//
///*!
// * @brief           This function initializes all components necessary for
// *                  simulated EEPROM in data flash.
// *
// * @details         This function prepares cache data entries, enables MemmAcc
// *                  and Fee.
//*/
static void EEPROM_Init(void)
{
//    uint32_t u32PortCacheEntry;
//    uint32_t u32PortDataEntry;
//
//    /* Prepare cache default values. */
//    for (u32PortCacheEntry = 0u; u32PortCacheEntry < (PORT_COUNT * PORT_DATA_ENTRY_COUNT); u32PortCacheEntry++)
//    {
//        sarPerPortData[u32PortCacheEntry].eState = WRITE_COMPLETE;
//        sarPerPortData[u32PortCacheEntry].u8Offset = PORT_DATA_ENTRY_SIZE * u32PortCacheEntry;
//
//        for (u32PortDataEntry = 0u; u32PortDataEntry < PORT_DATA_ENTRY_SIZE; u32PortDataEntry++)
//        {
//            sarPerPortData[u32PortCacheEntry].au8Data[u32PortDataEntry] = 0u;
//        }
//    }
//
//    /* Init MemAcc. */
//    MemAcc_Init(NULL_PTR);
//
//    /* Init Fee. */
//    Fee_Init(NULL_PTR);
//
//    /* Perform init Fee driver. */
//    do
//    {
//        EEPROM_Poll();
//    } while (MEMIF_IDLE != seMemStatus);
}
//
///*!
// * @brief           This function queues up data to be written to EEPROM.
// *
// * @param[in]       cu8Port Port ID.
// * @param[in]       cu8Offset EEPROM address offset.
// * @param[in]       cu32Length Data length.
// * @param[in]       cpu8Data Data to be enqueued.
//*/
static void EEPROM_Enqueue_Write(const uint8_t cu8Port,
                                 const uint8_t cu8Offset,
                                 const uint32_t cu32Length,
                                 const uint8_t *cpu8Data)
{
//    const uint32_t cu32Idx = (PORT_DATA_ENTRY_COUNT * cu8Port) + cu8Offset;
//    uint32_t       u32Entry;
//
//    if ((cu32Length <= PORT_DATA_ENTRY_SIZE) &&
//        (cu32Idx < (PORT_COUNT * PORT_DATA_ENTRY_COUNT)))
//    {
//        for (u32Entry = 0u; u32Entry < cu32Length; u32Entry++)
//        {
//            sarPerPortData[cu32Idx].au8Data[u32Entry] = cpu8Data[u32Entry];
//        }
//        sarPerPortData[cu32Idx].eState = WRITE_PENDING;
//    }
}
//
///*!
// * @brief           Executes actual write to EEPROM.
// *
// * @details         This function goes through the cache entry and executes
// *                  write above the first entry which has a WRITE_PENING state.
//*/
static void EEPROM_Write_Poll(void)
{
//    boolean  bIsWriteInProgress = false;
//    uint32_t u32PortCacheEntry;
//    uint16_t u16BlockNumber;
//
//    EEPROM_Poll();
//    if (MEMIF_IDLE == seMemStatus)
//    {
//        /* Clear status of previous write. */
//        for (u32PortCacheEntry = 0u; u32PortCacheEntry < (PORT_COUNT * PORT_DATA_ENTRY_COUNT); u32PortCacheEntry++)
//        {
//            if (WRITE_IN_PROGRESS == sarPerPortData[u32PortCacheEntry].eState)
//            {
//                sarPerPortData[u32PortCacheEntry].eState = WRITE_COMPLETE;
//            }
//        }
//        /* Write data from cache entry. */
//        for (u32PortCacheEntry = 0u; u32PortCacheEntry < (PORT_COUNT * PORT_DATA_ENTRY_COUNT); u32PortCacheEntry++)
//        {
//            if ((WRITE_PENDING == sarPerPortData[u32PortCacheEntry].eState) &&
//                !bIsWriteInProgress)
//            {
//                bIsWriteInProgress = true;
//                /* In case of necessity handle error. */
//                u16BlockNumber = sarPerPortData[u32PortCacheEntry].u8Offset == PDELAY_IDX_OFFSET ? FeeConf_FeeBlockConfiguration_FeeBlockConfiguration_0 : FeeConf_FeeBlockConfiguration_FeeBlockConfiguration_1;
//                Fee_Write(u16BlockNumber, sarPerPortData[u32PortCacheEntry].au8Data);
//                sarPerPortData[u32PortCacheEntry].eState = WRITE_IN_PROGRESS;
//            }
//        }
//    }
}
//
///*!
// * @brief           This function reads data from EEPROM.
// *
// * @param[in]       cu8Port Port ID.
// * @param[in]       cu8Offset EEPROM address offset.
// * @param[in]       cu32Length Data length.
// * @param[out]      pu8Data Data to be read.
// *
// * @return          0 on success.
//*/
static uint8_t EEPROM_Read(const uint8_t cu8Port,
                           const uint8_t cu8Offset,
                           const uint32_t cu32Length,
                           uint8_t *pu8Data)
{
    uint8_t        u8Ret = 0u;
//    const uint32_t cu32Idx = (PORT_DATA_ENTRY_COUNT * cu8Port) + cu8Offset;
//    uint32_t       u32Entry;
//    uint16_t       u16BlockNumber;
//
//    if (cu32Idx >= (PORT_COUNT * PORT_DATA_ENTRY_COUNT))
//    {
//        u8Ret = 1u;
//    }
//    else
//    {
//        /* If data is about to be written or is being written at the moment,
//           get the value from cache. */
//        if ((WRITE_IN_PROGRESS == sarPerPortData[cu32Idx].eState) ||
//            (WRITE_PENDING == sarPerPortData[cu32Idx].eState))
//        {
//            for (u32Entry = 0u; u32Entry < cu32Length; u32Entry++)
//            {
//                pu8Data[u32Entry] = sarPerPortData[cu32Idx].au8Data[u32Entry];
//            }
//        }
//        else
//        {
//            u16BlockNumber = sarPerPortData[cu32Idx].u8Offset == PDELAY_IDX_OFFSET ? FeeConf_FeeBlockConfiguration_FeeBlockConfiguration_0 : FeeConf_FeeBlockConfiguration_FeeBlockConfiguration_1;
//
//            /* Read data block. */
//            Fee_Read(u16BlockNumber, 0u, pu8Data, cu32Length);
//
//            /* Perform read data form Block 0. */
//            do
//            {
//                EEPROM_Poll();
//            } while (MEMIF_IDLE != seMemStatus);
//        }
//    }

    return u8Ret;
}
//
///*!
// * @brief           Executes actual EEPROM command.
// *
// * @details         This function call Fls/Fee main functions to execute
// *                  necessary actions.
//*/
static void EEPROM_Poll(void)
{
//    Fee_MainFunction();
//    MemAcc_MainFunction();
//    seMemStatus = Fee_GetStatus();
}

//
///*!
// * @brief           This function configures PPS output.
// *
// * @details         This function configures PPS output parameters.
// *
// * @param[in]       u8PPSCtrl Configuration of PPSCTRL field of MAC_PPS_CONTROL
// *                  register:
// *                      0 - 1Hz, short 20ns pulse
// *                      1 - 1Hz, 50% duty cycle
// *                      2 - 2Hz, 50% duty cycle
// *                      3 - 4Hz, 50% duty cycle
// *                      4 - 8Hz, 50% duty cycle
// *                      .....
// *                      15 - 32.768 kHz, 50% duty cycle
//*/
//static void Eth_Configure_1PPS_Output(uint8_t u8PPSCtrl)
//{
//    /* Clear the current PPSCTRL setting. */
//    Gmac_apxBases[0]->MAC_PPS_CONTROL &= ~GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK;
//     /* Set 1PPS output to 1Hz and 50% duty cycle. */
//    Gmac_apxBases[0]->MAC_PPS_CONTROL |= GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD(u8PPSCtrl);
//}
//
///*!
// * @brief           Callback function for EEPROM write.
//*/
uint8_t EEPROM_Write_CB(uint8_t u8PdelayMachine,
                        gptp_def_nvm_data_t eNvmDataType,
                        float64_t f64Value,
                        gptp_def_mem_write_stat *peWriteStat)
{
//    uint8_t u8Offset = eNvmDataType == GPTP_DEF_NVM_PDELAY ? PDELAY_IDX_OFFSET : RRATIO_IDX_OFFSET;
//    uint8_t au8Data[PORT_DATA_ENTRY_SIZE];
//    uint8_t u8Idx;
//
//    if (GPTP_DEF_MEM_WRITE_INIT == *peWriteStat)
//    {
//        for (u8Idx = 0u; u8Idx < PORT_DATA_ENTRY_SIZE; u8Idx++)
//        {
//           au8Data[u8Idx] = ((uint8_t*)&f64Value)[u8Idx];
//        }
//
//        EEPROM_Enqueue_Write(u8PdelayMachine, u8Offset, PORT_DATA_ENTRY_SIZE,
//                             au8Data);
//
//        *peWriteStat = GPTP_DEF_MEM_WRITE_FINISH;
//    }
//
    return 0u;
}
//
///*!
// * @brief           Callback function for EEPROM read.
//*/
uint8_t EEPROM_Read_CB(uint8_t u8PdelayMachine,
                       gptp_def_nvm_data_t eNvmDataType,
                       float64_t *f64Value)
{
//    uint8_t u8Status;
//    uint8_t u8Offset = eNvmDataType == GPTP_DEF_NVM_PDELAY ? PDELAY_IDX_OFFSET : RRATIO_IDX_OFFSET;
//    uint8_t au8Data[PORT_DATA_ENTRY_SIZE];
//    uint8_t u8Idx;
//
//    u8Status = EEPROM_Read(u8PdelayMachine, u8Offset, PORT_DATA_ENTRY_SIZE,
//                           au8Data);
//
//    for (u8Idx = 0u; u8Idx < PORT_DATA_ENTRY_SIZE; u8Idx++)
//    {
//       ((uint8_t*)f64Value)[u8Idx] = au8Data[u8Idx];
//    }
//
//   return u8Status;
}

static void Eth_PollLinkStatus(void)
{
    uint8_t                      u8CtrlIdx;
    /* Current link status. */
    static EthTrcv_LinkStateType_g seLinkState;
    /* Last link status for change detection. */
    static EthTrcv_LinkStateType_g seLastLinkState[GMAC_MAX_CTRLIDX_SUPPORTED] = {ETHTRCV_LINK_ST_DOWN};

    for (u8CtrlIdx = 0u; u8CtrlIdx < GMAC_MAX_CTRLIDX_SUPPORTED; u8CtrlIdx++) {
    				//implemented in GMAC_Task
        if (E_OK == EthTrcv_GetLinkState(u8CtrlIdx, &seLinkState))
        {
            /* Detect link status change. */
            if (seLastLinkState[u8CtrlIdx] != seLinkState)
            {
                seLastLinkState[u8CtrlIdx] = seLinkState;
                /* Notify via EthIf API. */
                EthIf_TrcvLinkStateChg(u8CtrlIdx, seLinkState);
            }
        }
    }
}

static void Eth_Poll(void)
{
    uint8            u8FifoIdx;
    Eth_RxStatusType rRxStatus;

    /*for (u8FifoIdx = 0u; u8FifoIdx < ETH_43_GMAC_MAX_RXFIFO_SUPPORTED; u8FifoIdx++)
    {
        Eth_43_GMAC_Receive(EthConf_EthCtrlConfig_EthCtrlConfig_0, u8FifoIdx,
                            &rRxStatus);
    }

    Eth_43_GMAC_TxConfirmation(EthConf_EthCtrlConfig_EthCtrlConfig_0);*/
    if(polling != 1){
    	polling = 1;
		eth_rx_check();
		enet_tx_free_buffer();
		polling = 0;
    }
    else{
    	printf("interrupt!\r\n");
    }

