TramaEngineering/S32K344-CANHUB_Demo/src/main.c
}

/**
 * @brief        Main function of the example
 * @details      Initializes the used drivers and uses 1 binary Semaphore and
 *               2 tasks to toggle a LED.
 */

int main(void)
{
	uint8 timer0, timer1, annouce = 0;
	Gmac_Ip_TimestampType srEgressTimeStamp;
	uint16 seq_id;
	static uint32 message_index = 0;
	/* Initialize Clock */
	OsIf_Init(NULL_PTR);

	/* Initialize all pins using the Port driver */
	Siul2_Port_Ip_PortStatusType Status_Init_Port = SIUL2_PORT_ERROR;
	Status_Init_Port = Siul2_Port_Ip_Init(NUM_OF_CONFIGURED_PINS_PortContainer_0_BOARD_InitPeripherals, g_pin_mux_InitConfigArr_PortContainer_0_BOARD_InitPeripherals);

	if(Status_Init_Port != SIUL2_PORT_SUCCESS)
	{
		while(1); /* Error during initialization. */
	}

	/* Set RGB to indicate initialization */
	//set_rgb_status(INITIALIZE);

	Clock_Ip_StatusType Status_Init_Clock = CLOCK_IP_ERROR;
	Status_Init_Clock = Clock_Ip_Init(Clock_Ip_aClockConfig);

	if(Status_Init_Clock != CLOCK_IP_SUCCESS)
	{
		//set_rgb_status(ERROR);
		while(1); /* Error during initialization. */
	}

	/* Initialize the FS26 to stop it from resetting */
	Lpspi_Ip_Init(&Lpspi_Ip_PhyUnitConfig_SpiPhyUnit_3_Instance_3);
	Console_SerialPort_Init();
	/*ERROR IN START UP*/
	fs26_initialize(&fs26SpiTransferFunction);

	/* Intialize for SIUL ICU for external interrupts from the buttons */
	Siul2_Icu_Ip_Init(0, &Siul2_Icu_Ip_0_Config_PB);
	Siul2_Icu_Ip_EnableInterrupt(0, 5);  /* EIRQ5  PTA25 */
	Siul2_Icu_Ip_EnableNotification(0, 5);
	Siul2_Icu_Ip_EnableInterrupt(0, 31); /* EIRQ31 PTD15 */
	Siul2_Icu_Ip_EnableNotification(0, 31);

#ifdef NO_FREERTOS
		IntCtrl_Ip_Init(&IntCtrlConfig_0);
#endif

	/*set handler for interrupt*/
	IntCtrl_Ip_InstallHandler(SIUL_0_IRQn, SIUL2_EXT_IRQ_0_7_ISR, NULL_PTR);
	/*set priority handler for the external input*/
	IntCtrl_Ip_SetPriority(SIUL_0_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	/*enable IRQ for switch 1*/
	IntCtrl_Ip_EnableIrq(SIUL_0_IRQn);

	IntCtrl_Ip_InstallHandler(SIUL_3_IRQn, SIUL2_EXT_IRQ_24_31_ISR, NULL_PTR);
	IntCtrl_Ip_SetPriority(SIUL_3_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	IntCtrl_Ip_EnableIrq(SIUL_3_IRQn);

	IntCtrl_Ip_InstallHandler(PIT0_IRQn, PIT_0_ISR, NULL_PTR);
	IntCtrl_Ip_SetPriority(PIT0_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	IntCtrl_Ip_EnableIrq(PIT0_IRQn);

	/*PIT initialization*/
	Pit_Ip_Init(PIT_0_IP_INSTANCE_NUMBER, &PIT_0_InitConfig_PB);
	/*PIT channel initialization*/
	Pit_Ip_InitChannel(PIT_0_IP_INSTANCE_NUMBER, &PIT_0_ChannelConfig_PB[0U]);
	//	/* Start PIT0 channel0, PIT0 clocks from AIPS_SLOW_CLK 40MHz, so here the timeout 40000 means 1mS */
	//	Pit_Ip_StartChannel(PIT_0_IP_INSTANCE_NUMBER, 0, 40000);
	/* Start PIT0 channel0, PIT0 clocks from AIPS_SLOW_CLK 40MHz, so here the timeout 2000 means 50uS */
	Pit_Ip_StartChannel(PIT_0_IP_INSTANCE_NUMBER, 0, 2000);
	/*enable channel interrupt*/
	Pit_Ip_EnableChannelInterrupt(PIT_0_IP_INSTANCE_NUMBER, 0);
	/*load the interrupt configuration*/


	/* Initialize ethernet MAC */
	/*set the MAC to slave mode and not to master mode*/
	Gmac_Ip_StatusType Status_Init_Gmac = GMAC_STATUS_ERROR;

#ifndef NO_FREERTOS
	Status_Init_Gmac = enet_init_freertos(&tx_queue_send);
#else
	Status_Init_Gmac = enet_init();
#endif

	if(Status_Init_Gmac != GMAC_STATUS_SUCCESS)
	{
		//set_rgb_status(ERROR);
		while(1); /* Error during initialization. */
	}

	/* Initialize CAN0 .. CAN5 */
	for(int i = 0; i < CAN_COUNT; i++) {
		CAN* can;
		can = can_init(i);
		if(can != NULL) {
			eth_can_queues[i] = can->eth_can_queue;
		} else {
			set_rgb_status(ERROR);
			while(1); /* Error during initialization. */
		}
	}

	gptp_err_type_t err = GPTP_GptpInit(&rGptpCfgParams);
	DevAssert(GPTP_ERR_OK == err);

	set_rgb_status(NOMINAL);

#ifndef NO_FREERTOS
	/*start link check task*/
	start_link_check();

	/* Start Listening to ethernet packets */
	enet_start_rx(eth_can_queues, CAN_COUNT);

	/*create a thread that pools on a message queue and send the message when it receive one*/
	enet_start_tx();

	/* Start FreeRTOS */
	vTaskStartScheduler();

	/* Scheduler returned this an error was encountered */
	set_rgb_status(ERROR);
#endif

	//printf("Error in code!\r\n");

	for( ;; ){
#ifdef NO_FREERTOS
		timer0 = Task_Flag_Cnt;


		if(annouce == 0){
			//send_eth_frame_lld(&pDelayReq);
			send_eth_frame_lld(&arpAnnouce);
			annouce = 1;
		}
		if(Task_Flag_50uS){
			Task_Flag_50uS = 0;
			if((send_dummy != 0) && send_fr == 50){
				for(uint16 i=0; i<send_dummy; i+=4){
					udpFrame[18+20+8+i + 0] = (uint8_t)(message_index & 0xFF);
					udpFrame[18+20+8+i + 1] = (uint8_t)((message_index >> 8) & 0xFF);
					udpFrame[18+20+8+i + 2] = (uint8_t)((message_index >> 16) & 0xFF);
					udpFrame[18+20+8+i + 3] = (uint8_t)((message_index >> 24) & 0xFF);
				}
				message_index++;
				send_eth_frame_lld(customMessage_UDP);
				Siul2_Dio_Ip_TogglePins(TP31_PORT, 1<<TP31_PIN);
			}
			Eth_Poll();
		}
		if(Task_Flag_100uS){
			Eth_Poll();
			Task_Flag_100uS = 0;
			if((send_dummy != 0) && send_fr == 100){
				for(uint16 i=0; i<send_dummy; i+=4){
					udpFrame[18+20+8+i + 0] = (uint8_t)(message_index & 0xFF);
					udpFrame[18+20+8+i + 1] = (uint8_t)((message_index >> 8) & 0xFF);
					udpFrame[18+20+8+i + 2] = (uint8_t)((message_index >> 16) & 0xFF);
					udpFrame[18+20+8+i + 3] = (uint8_t)((message_index >> 24) & 0xFF);
				}
				message_index++;
				send_eth_frame_lld(customMessage_UDP);
			}
		}
		if(Task_Flag_200uS){
			Task_Flag_200uS = 0;
			if((send_dummy != 0) && send_fr == 200){
				for(uint16 i=0; i<send_dummy; i+=4){
					udpFrame[18+20+8+i + 0] = (uint8_t)(message_index & 0xFF);
					udpFrame[18+20+8+i + 1] = (uint8_t)((message_index >> 8) & 0xFF);
					udpFrame[18+20+8+i + 2] = (uint8_t)((message_index >> 16) & 0xFF);
					udpFrame[18+20+8+i + 3] = (uint8_t)((message_index >> 24) & 0xFF);
				}
				message_index++;
				send_eth_frame_lld(customMessage_UDP);
			}
		}
		if(Task_Flag_2mS){
			Task_Flag_2mS = 0;
			Eth_PollLinkStatus();
			//Eth_Poll();
			//if(timestamp.seconds < old_timestamp.seconds)
				//printf("old 2ms TS: %u s %u ns, new TS: %u s %u ns\r\n", old_timestamp.seconds,old_timestamp.seconds, timestamp.nanoseconds,timestamp.nanoseconds);
			/* Add task call for 1ms interval */

		}
		if(Task_Flag_1mS){
			Task_Flag_1mS = 0;
			if((send_dummy != 0) && send_fr == 1){
				for(uint16 i=0; i<send_dummy; i+=4){
					udpFrame[18+20+8+i + 0] = (uint8_t)(message_index);
					udpFrame[18+20+8+i + 1] = (uint8_t)((message_index >> 8) & 0xFF);
					udpFrame[18+20+8+i + 2] = (uint8_t)((message_index >> 16) & 0xFF);
					udpFrame[18+20+8+i + 3] = (uint8_t)((message_index >> 24) & 0xFF);
				}
				message_index++;
				send_eth_frame_lld(customMessage_UDP);
			}
		}
		if(Task_Flag_10mS){
			Task_Flag_10mS = 0;
			//get_ts_ingress_data(&srEgressTimeStamp, seq_id);
			//printf("difference 1ms %u s %u ns\r\n", timestamp.seconds/*-old_timestamp.seconds*/, timestamp.nanoseconds/*-old_timestamp.nanoseconds*/);
			GPTP_TimerPeriodic();
		}
		if(Task_Flag_1000mS){
			Task_Flag_1000mS = 0;
			//send_eth_frame_lld(&customMessage_ipv4);
		}


		timer1 = Task_Flag_Cnt;

#endif
	}


	return 0;
}

/** @} */
